["Bletchley Park in Myth and Memory","Book Review: Paradoxa# 31: Climate Fictions. Edited by Alison Sperling","J. G. Ballard and the Sciences","J. G. Ballard and Making: An Experiment in Collaborative Practice","J. G. Ballard and Making","Philip K. Dick Special Issue","Philip K. Dick special section: Thomas Knowles with Terence Sawyers: Guest Editorial","Weird Border Crossings in China Miéville’s “Looking for Jake”, “The Tain” and “Säcken”","Conference report on ‘J. G. Ballard and the Sciences’","J. G. Ballard and the 'Natural' World","Special issue: J.G. Ballard and the ‘Natural’ World","The Machinery of Progress: review of Colson Whitehead, The Underground Railroad","‘Deep Assignments': review of Rick McGrath ed. J. G. Ballard: Deep Ends 2016","Review of Mark Sandy, et al. Decadent Romanticism: 1790-1914","Aeolian Harps in the Desert: Romanticism and Vermilion Sands","Conference report on ‘Philip K. Dick Day 2016’","Review of Emily Rohrbach, Modernity’s Mist: British Romanticism and the Poetics of Anticipation","Review of Patricia McKee, Reading Constellations: Urban Modernity in Victorian Fiction","The Automobile as Moving Castle","‘In response to E. R. Hughes’, Midsummer’s Eve’","Insanity and the Lunatic Asylum in the Nineteenth Century","The Legacy of Victorian Asylums in the Landscape of Contemporary British Literature","'Hope'","Bletchley Park in Myth and Memory","Observational Comedy: Mass-Observation and the Wartime Joke, 1939-1945","The real special relationship: the true story of how the British and US secret services work together by Michael Smith, Simon and Schuster, London, 2022, 553 pp., £25 (hardback), ISBN13: 9781471186790","John Cairncross, RASCLS and a Reassessment of His Motives","The Great Chester Cat Hoax: Creating an Urban Legend in the Anglosphere Press, 1815-1955","Behind the enigma: the authorised history of GCHQ, Britain’s secret cyber-intelligence agency: by John Ferris, London, Bloomsbury, 2020, 848 pp., £30 (hardback), ISBN HB: 978-1-5266-0546-7","Bletchley Park and Big Science:  Industrialising the Secret War, 1939-1945","The Last Cambridge Spy: John Cairncross, Bletchley Codebreaker and Soviet Double Agent","Sherlock Holmes and the Nazis:  Fifth Columnists and the People’s War in Anglo-American Cinema, 1942-1943","Women in the Shadow War: Gender, Class and MI5 in the Second World War","‘Bright chaps for hush-hush jobs’: masculinity, class and civilians in uniform at Bletchley Park","Bletchley Park and the Development of the Rockex Cipher Systems: Building a Technocratic Culture, 1941–1945","Review: The Letters of Dr. Thomas Coke by John A. Vickers (Ed,) (Nashville,TN; Kingswood Press, 2013)","The Hidden History of Bletchley Park: A Social and Organisational History, 1939-1945","How I learned to stop worrying and love the Bombe: Machine Research and Development and Bletchley Park","Operating secret machines: Military women and the intelligence production line, 1939–1945","Review: The Secret Life of Bletchley Park: The History of the Wartime Codebreaking Centre by the Men and Women Who Were There","10 Years on with French Arbitration Law Reform: Does the Judicial Control Frustrate or Facilitate the Enforcement of Arbitral Awards?","Anti-suit injunction: paving the way to arbitration of antitrust claims?","Anti-suit Injunctions under OHADA Law: Could this Mechanism Turn the Tide?","The Privity of Contract Under the Contracts (Rights of Third Parties) Act: Frustrate or Facilitate the Participation of Third Parties to the Arbitration?","Third party arbitration in the UK: critically assessing the applicable rules of the joinder of two different proceedings under the Brussels Recast Regulation (EU 1215\/2012)","Flipped for Critical Thinking: Evaluating the Effectiveness of a Novel Teaching Approach in Postgraduate Law Modules","The Impact of the UK’s BREXIT on Anti-Suit Injunctions","The State of International Arbitration in Kenya","Chinese Migrant Children: Do They Have the Right to Education?","Flipped For Critical Thinking: Evaluating The Effectiveness Of A Novel Teaching Approach In Postgraduate Law Modules","A Departure from West Tankers after Brexit? Anti-suit Injunctions in the UK Directed to Parties in EU National Courts","Revisiting Anti-suit Injunctions Post Brexit: Some Lessons from US","Arbitration in the Republic of Ireland after Brexit","Does the Will of the Parties Supersede the Sovereignty of the State? Anti-suit Injunctions in the UK Post-Brexit","Is this the end? The effect of Brexit on the arbitration of EU competition laws in the UK","Third party arbitration under English law","3D forensic science: An introductory statement from the members of the Forensic Capability Network (FCN) Visual Technologies Research Group (VTRG)","An ethical framework for the creation and use of 3D printed human remains in crime reconstruction","Drilling down into ethics: A thematic review of ethical considerations for the creation and use of 3D printed human remains in crime reconstruction","Exploring public perceptions of creating and using 3D printed human remains","A multi-method assessment of 3D printed micromorphological osteological features","A survey of case studies on the use of forensic three-dimensional printing in England and Wales","3D forensic science: A new field integrating 3D imaging and 3D printing in crime reconstruction","Assessment of the accuracy of 3D printed teeth by various 3D printers in forensic odontology","Experimental assessment of the surface quality of 3D printed bones","Suitability of 3D printing cranial trauma: prospective novel applications and limitations of 3D replicas","Achieving accurate estimates of fetal gestational age and personalised predictions of fetal growth based on data from an international prospective cohort study: a population-based machine learning study","An Overview of 3D Printing in Forensic Science: The Tangible Third-Dimension","A step-by-step method for producing 3D crania models from CT data","Digital Dilemma 2018","Digital Dilemma 2018: Digital Presentations in Biological Anthropology and Bioarchaeology","Accuracy of computed radiography in osteometry: A comparison of digital imaging techniques and the effect of magnification","A Preliminary Investigation into the Accuracy of 3D Modeling and 3D Printing in Forensic Anthropology Evidence Reconstruction","Imaging in forensic science: Five years on","Precision of recumbent crown-heel length when using an infantometer","A CFD-Based Numerical Evaluation, Assessment and Optimization of Conjugate Heat Transfer for Aerodynamic Cooling of a Wheel-Hub-Motors in Micro-Mobility Vehicles","Comparison of the effect of one-way and two-way fire-wind coupling on the modelling of wildland fire propagation dynamics","Development and Testing of Ni-Cu Bimetallic Catalysts for Effective Syngas Production via Low-Temperature Methane Steam Reforming","Heat Transfer Performance Enhancement On Wheel Hub Motor With Fin Adjoint Optimization","Metal-Hydride-Based Hydrogen Storage as Potential Heat Source for the Cold Start of PEMFC in Hydrogen-Powered Coaches:  A Comparative Study of Various Materials and Thermal Management Techniques","Ni\/Co Bimetallic Flower-Like Metal-Organic Frameworks with Enhanced Performance for High-PowerEnergy Storage Applications","Synthesis and Characterisation of Iron Oxide Nanoparticles with Tunable Sizes by Hydrothermal Method","Adsorption of lead on the surfaces of pristine and B, Si and N-doped graphene","Self-diffusion in garnet-type Li7La3Zr2O12 solid electrolytes","Study on the operation and energy demand of dual-stage Metal Hydride Hydrogen Compressors under effective thermal management","Encapsulation and substitution of Fe in C12A7 (12CaO⋅ 7Al2O3)","Hydrogen Technologies for Mobility and Stationary Applications: Hydrogen Production, Storage and Infrastructure Development","Life Cycle Costing Analysis: Tools and Applications for Determining Hydrogen Production Cost for Fuel Cell Vehicle Technology","Numerical Investigation on the Operation and Energy Demand of a Seven-Stage Metal Hydride Hydrogen Compression System for Hydrogen Refuelling Stations","Sustainable hydrogen production via LiH hydrolysis for unmanned air vehicle (UAV) applications","Thermal characteristics of an air‐cooled open‐cathode proton exchange membrane fuel cell stack via numerical investigation","Dinitrogen activation by zirconium dimer loaded C60","Heat management on rectangular metal hydride tanks for green building applications","High efficient catalytic degradation of tetracycline and ibuprofen using visible light driven novel Cu\/Bi2Ti2O7\/rGO nanocomposite: Kinetics, intermediates and mechanism","Mg6MnO8 as a Magnesium-Ion Battery Material: Defects, Dopants and Mg-Ion Transport","Study on the Hydrogenation of a Mm-based AB5-Intermetallic for Sustainable Building Applications","Synthesis, characterisation and hydrogen sorption properties of mechanically alloyed Mg(Ni1-xMnx)2","Catalytic performance of Ni-Cu\/Al2O3 for effective syngas production by methanol steam reforming","Hydrogenation behavior in rectangular metal hydride tanks under effective heat management processes for green building applications","Life Cycle Costing Analysis for Determining Hydrogen Cost for Mobility Applications","Metal Hydride Hydrogen Compression Systems–Materials, Applications and Numerical Analysis","Metal hydrides: Modeling of metal hydrides to be operated in a fuel cell","Novel hybrid-powered stand alone autonomous unmanned aerial vehicle (AUV) ground base station","Parametric Study on the Heat Management of Metal Hydride Tanks for Sustainable Building Applications","A review of a stand-alone Hydrogen system application for private houses in Greece and the use of Phase change materials in their building construction","Experimental and Numerical Study of Low Temperature Methane Steam Reforming for Hydrogen Production","Numerical analysis of candidate materials for multi-stage metal hydride hydrogen compression processes","PCMs for Residential Building Applications: A Short Review Focused on Disadvantages and Proposals for Future Development","The Benefits of Lean through an Analysis and Improvement of an Existing Production Line","Effective thermal management of a cylindrical MgH2 tank including thermal coupling with an operating SOFC and the usage of extended surfaces during the dehydrogenation process","Efficient hydrogen storage in up-scale metal hydride tanks as possible metal hydride compression agents equipped with aluminium extended surfaces","Structure, Microstructure and hydrogen storage properties of melt-spun V55Ti21Mn17Fe7 and V55Ti21Cr17Fe7","A complete transport validated model on a zeolite membrane for carbon dioxide permeance and capture","Numerical study on a two-stage Metal Hydride Hydrogen Compression system","“Substitutionability” of the Critical Raw Materials in Energy Applications: A Short Review and Perspectives","Chemical characterization of particulate matter (PM) and source apportionment study during winter and summer period for the city of Kozani, Greece","High-temperature activated AB2 nanopowders for metal hydride hydrogen compression","Microstuctural analysis and determination of PM10 emission sources in an industrial Mediterranean city","In vitro magnetic hyperthermia response of iron oxide MNP’s incorporated in DA3, MCF-7 and HeLa cancer cell lines","Modeling and Simulation for Absorption-Desorption Cyclic Process on a Three-Stage Metal Hydride Hydrogen Compressor","Nanotechnology and Innovation: Recent Status and the Strategic Implication for the Formation of High Tech Clusters in Greece, in between a Global Economic Crisis","Polymer-stable magnesium nanocomposites prepared by laser ablation for efficient hydrogen storage"]